Revit 2027 API
ElectricalLoadAreaData.CreateElectricalLoadAreas Method
 Creates electrical load areas on all the empty plan circuits of the given level.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ISet<ElementId> CreateElectricalLoadAreas(
	Document doc,
	ElementId levelId,
	ElementId phaseId
)
Public Shared Function CreateElectricalLoadAreas (
	doc As Document,
	levelId As ElementId,
	phaseId As ElementId
) As ISet(Of ElementId)
public:
static ISet<ElementId^>^ CreateElectricalLoadAreas(
	Document^ doc,
	ElementId^ levelId,
	ElementId^ phaseId
)
static member CreateElectricalLoadAreas :
        doc : Document *
        levelId : ElementId *
        phaseId : ElementId -> ISet<ElementId>
Parameters
doc Document
 The document where the created electrical load areas are.
levelId ElementId
 The base level on which the created electrical load areas exist.
phaseId ElementId
 The associated phase in which the created electrical load areas exist.
Return Value
ISet<ElementId>
 The created electrical load areas.
Exceptions
Exception | Condition
ArgumentException |  doc is not a project document. -or- The ElementId levelId is not a Level. -or- The id does not represent a valid phase.
ArgumentNullException |  A non-optional argument was null
InvalidOperationException |  The document is in failure mode: an operation has failed, and Revit requires the user to either cancel the operation or fix the problem (usually by deleting certain elements).
ModificationForbiddenException |  The document is in failure mode: an operation has failed, and Revit requires the user to either cancel the operation or fix the problem (usually by deleting certain elements). -or- The document is being loaded, or is in the midst of another sensitive process.
ModificationOutsideTransactionException |  The document has no open transaction.
Remarks
 Use the HasCircuitsWithoutElectricalLoadAreas to check whether there are empty plan circuits in which there are no electrical load areas, if there are empty plan circuits, this API will create electrical load areas on each of them, otherwise, it will create nothing. In most cases, the electrical load areas will be created, updated and deleted automatically, but in some cases, there are some empty plan circuits and need to create electrical load areas on each of them.
See Also
Reference
ElectricalLoadAreaData Class
Autodesk.Revit.DB.Electrical Namespace